{
    "format": "layers-model",
    "generatedBy": "keras v2.15.0",
    "convertedBy": "TensorFlow.js Converter v4.17.0",
    "modelTopology": {
      "keras_version": "2.15.0",
      "backend": "tensorflow",
      "model_config": {
        "class_name": "Sequential",
        "config": {
          "name": "sequential_4",
          "layers": [
            {
              "class_name": "InputLayer",
              "config": {
                "batch_input_shape": [
                  null,
                  30,
                  1662
                ],
                "dtype": "float32",
                "sparse": false,
                "ragged": false,
                "name": "gru_12_input"
              }
            },
            {
              "class_name": "GRU",
              "config": {
                "name": "gru_12",
                "trainable": true,
                "dtype": "float32",
                "batch_input_shape": [
                  null,
                  30,
                  1662
                ],
                "return_sequences": true,
                "return_state": false,
                "go_backwards": false,
                "stateful": false,
                "unroll": false,
                "time_major": false,
                "units": 64,
                "activation": "relu",
                "recurrent_activation": "sigmoid",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  },
                  "registered_name": null
                },
                "recurrent_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Orthogonal",
                  "config": {
                    "gain": 1,
                    "seed": null
                  },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {},
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "recurrent_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "recurrent_constraint": null,
                "bias_constraint": null,
                "dropout": 0,
                "recurrent_dropout": 0,
                "implementation": 2,
                "reset_after": false
              }
            },
            {
              "class_name": "GRU",
              "config": {
                "name": "gru_13",
                "trainable": true,
                "dtype": "float32",
                "return_sequences": true,
                "return_state": false,
                "go_backwards": false,
                "stateful": false,
                "unroll": false,
                "time_major": false,
                "units": 128,
                "activation": "relu",
                "recurrent_activation": "sigmoid",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  },
                  "registered_name": null
                },
                "recurrent_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Orthogonal",
                  "config": {
                    "gain": 1,
                    "seed": null
                  },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {},
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "recurrent_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "recurrent_constraint": null,
                "bias_constraint": null,
                "dropout": 0,
                "recurrent_dropout": 0,
                "implementation": 2,
                "reset_after": false
              }
            },
            {
              "class_name": "GRU",
              "config": {
                "name": "gru_14",
                "trainable": true,
                "dtype": "float32",
                "return_sequences": false,
                "return_state": false,
                "go_backwards": false,
                "stateful": false,
                "unroll": false,
                "time_major": false,
                "units": 32,
                "activation": "relu",
                "recurrent_activation": "sigmoid",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  },
                  "registered_name": null
                },
                "recurrent_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Orthogonal",
                  "config": {
                    "gain": 1,
                    "seed": null
                  },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {},
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "recurrent_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "recurrent_constraint": null,
                "bias_constraint": null,
                "dropout": 0,
                "recurrent_dropout": 0,
                "implementation": 2,
                "reset_after": false
              }
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense_12",
                "trainable": true,
                "dtype": "float32",
                "units": 64,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {},
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense_13",
                "trainable": true,
                "dtype": "float32",
                "units": 32,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {},
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense_14",
                "trainable": true,
                "dtype": "float32",
                "units": 6,
                "activation": "softmax",
                "use_bias": true,
                "kernel_initializer": {
                  "module": "keras.initializers",
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  },
                  "registered_name": null
                },
                "bias_initializer": {
                  "module": "keras.initializers",
                  "class_name": "Zeros",
                  "config": {},
                  "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            }
          ]
        }
      },
      "training_config": {
        "loss": "categorical_crossentropy",
        "metrics": [
          [
            {
              "class_name": "MeanMetricWrapper",
              "config": {
                "name": "categorical_accuracy",
                "dtype": "float32",
                "fn": "categorical_accuracy"
              }
            }
          ]
        ],
        "weighted_metrics": null,
        "loss_weights": null,
        "optimizer_config": {
          "class_name": "Custom>Adam",
          "config": {
            "name": "Adam",
            "weight_decay": null,
            "clipnorm": null,
            "global_clipnorm": null,
            "clipvalue": null,
            "use_ema": false,
            "ema_momentum": 0.99,
            "ema_overwrite_frequency": null,
            "jit_compile": false,
            "is_legacy_optimizer": false,
            "learning_rate": 0.0010000000474974513,
            "beta_1": 0.9,
            "beta_2": 0.999,
            "epsilon": 1e-7,
            "amsgrad": false
          }
        }
      }
    },
    "weightsManifest": [
      {
        "paths": [
          "group1-shard1of1.bin"
        ],
        "weights": [
          {
            "name": "dense_12/kernel",
            "shape": [
              32,
              64
            ],
            "dtype": "float32"
          },
          {
            "name": "dense_12/bias",
            "shape": [
              64
            ],
            "dtype": "float32"
          },
          {
            "name": "dense_13/kernel",
            "shape": [
              64,
              32
            ],
            "dtype": "float32"
          },
          {
            "name": "dense_13/bias",
            "shape": [
              32
            ],
            "dtype": "float32"
          },
          {
            "name": "dense_14/kernel",
            "shape": [
              32,
              6
            ],
            "dtype": "float32"
          },
          {
            "name": "dense_14/bias",
            "shape": [
              6
            ],
            "dtype": "float32"
          },
          {
            "name": "gru_12/gru_cell/kernel",
            "shape": [
              1662,
              192
            ],
            "dtype": "float32"
          },
          {
            "name": "gru_12/gru_cell/recurrent_kernel",
            "shape": [
              64,
              192
            ],
            "dtype": "float32"
          },
          {
            "name": "gru_12/gru_cell/bias",
            "shape": [
              
              192
            ],
            "dtype": "float32"
          },
          {
            "name": "gru_13/gru_cell/kernel",
            "shape": [
              64,
              384
            ],
            "dtype": "float32"
          },
          {
            "name": "gru_13/gru_cell/recurrent_kernel",
            "shape": [
              128,
              384
            ],
            "dtype": "float32"
          },
          {
            "name": "gru_13/gru_cell/bias",
            "shape": [
              
              384
            ],
            "dtype": "float32"
          },
          {
            "name": "gru_14/gru_cell/kernel",
            "shape": [
              128,
              96
            ],
            "dtype": "float32"
          },
          {
            "name": "gru_14/gru_cell/recurrent_kernel",
            "shape": [
              32,
              96
            ],
            "dtype": "float32"
          },
          {
            "name": "gru_14/gru_cell/bias",
            "shape": [
              
              96
            ],
            "dtype": "float32"
          }
        ]
      }
    ]
  }